[M_Sage_EggOnFace MissionDefinition]
MissionDescription="Dietmar Von Heinrichzimmerschneit needs footage of you collecting eggs. <br><br>That's it, really."
TurnInDescription="The quest was hard, but you made it seem OVER EASY.<br><br>Sorry."
